# BuildingPadNotConnected Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SiteFailures..::..BuildingPadNotConnected Property
BuiltInFailures..::..SiteFailures Class See Also
---
Can't create a single Pad with several connected regions.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId BuildingPadNotConnected { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BuildingPadNotConnected As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ BuildingPadNotConnected {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SiteFailures Class
Autodesk.Revit.DB Namespace